<template>
    <div>
        <MovieInfo :movie="movie" v-for="movie in movies" :key="movie.id" />
        <AddNewMovie @addNMovie="addNMovie" />
    </div>
</template>

<script>
import AddNewMovie from './AddNewMovie.vue';
import MovieInfo from './MovieInfo.vue'
export default {
    name: 'MovieList',
    components: {
        MovieInfo,
        AddNewMovie
    },

    data() {
        return {
            movies: [{
                title: 'фильм 1',
                producer: 'Автор 1',
                date: 2020,
                moreInfo: 'aaa'
            }, {
                title: 'фильм 2',
                producer: 'Автор 2',
                date: 2019,
                moreInfo: 'aaa'
            }, {
                title: 'фильм 3',
                producer: 'Автор 3',
                date: 2021,
                moreInfo: 'aaa'
            }, {
                title: 'фильм 4',
                producer: 'Автор 4',
                date: 2022,
                moreInfo: 'aaa'
            },]

        };
    },

    methods: {
        addNMovie(dataFilm) {
            this.movies.push(dataFilm)
        }
    },
};
</script>

<style lang="scss" scoped></style>
<!-- Вам предстоит создать простое приложение на Vue.js для отображения списка фильмов. У вас есть массив объектов с информацией о фильмах, и вы должны создать два компонента: родительский компонент "Список фильмов" и дочерний компонент "Информация о фильме".

Родительский компонент "Список фильмов" будет отображать список фильмов, используя дочерний компонент "Информация о фильме" для отображения дополнительных деталей о каждом фильме по клику.
Создайте родительский компонент "MovieList", который содержит список фильмов.
Создайте дочерний компонент "MovieInfo", который отображает информацию о фильме и может передавать данные о фильме обратно в родительский компонент.
Импортируйте дочерний компонент в родительский компонент.
Передайте информацию о фильмах из родительского компонента в дочерний компонент через props.
При клике на каждый элемент списка фильмов в дочернем компоненте "MovieInfo" показывайте или скрывайте дополнительные детали о фильме.
При клике на кнопку в дочернем компоненте "MovieInfo", передайте некоторую информацию о фильме обратно в родительский компонент.
В родительском компоненте отобразите информацию о фильме, которую вы получили от дочернего компонента. -->